Task: Analyzing a Bookstore Database
Objective:
Create a database for a bookstore, insert relevant data, and perform various queries to analyze the data.

Database Name: bookstore.db

Steps:
Create Tables:

Authors
Books
Sales
Insert Data:
Insert sample data into each table.
Queries:
-- Insert data into the Authors table
INSERT INTO Authors (name, country) VALUES ('George Orwell', 'United Kingdom');
INSERT INTO Authors (name, country) VALUES ('Harper Lee', 'United States');
INSERT INTO Authors (name, country) VALUES ('J.K. Rowling', 'United Kingdom');
INSERT INTO Authors (name, country) VALUES ('J.R.R. Tolkien', 'United Kingdom');

-- Insert data into the Books table
INSERT INTO Books (title, author_id, price) VALUES ('1984', 1, 9.99);
INSERT INTO Books (title, author_id, price) VALUES ('Animal Farm', 1, 7.99);
INSERT INTO Books (title, author_id, price) VALUES ('To Kill a Mockingbird', 2, 8.99);
INSERT INTO Books (title, author_id, price) VALUES ('Harry Potter and the Sorcerer''s Stone', 3, 10.99);
INSERT INTO Books (title, author_id, price) VALUES ('The Hobbit', 4, 12.99);

-- Insert data into the Sales table
INSERT INTO Sales (book_id, sale_date, quantity) VALUES (1, '2023-06-01', 50);
INSERT INTO Sales (book_id, sale_date, quantity) VALUES (2, '2023-06-01', 30);
INSERT INTO Sales (book_id, sale_date, quantity) VALUES (3, '2023-06-01', 40);
INSERT INTO Sales (book_id, sale_date, quantity) VALUES (4, '2023-06-01', 60);
INSERT INTO Sales (book_id, sale_date, quantity) VALUES (5, '2023-06-01', 25);
INSERT INTO Sales (book_id, sale_date, quantity) VALUES (1, '2023-06-02', 20);
INSERT INTO Sales (book_id, sale_date, quantity) VALUES (2, '2023-06-02', 25);
INSERT INTO Sales (book_id, sale_date, quantity) VALUES (3, '2023-06-02', 35);
INSERT INTO Sales (book_id, sale_date, quantity) VALUES (4, '2023-06-02', 50);
INSERT INTO Sales (book_id, sale_date, quantity) VALUES (5, '2023-06-02', 30);

Retrieve a list of all books with their authors.
Calculate the total sales for each book.
Find the author with the highest number of books.
List the top 3 best-selling books.

In [1]:
import sqlite3

In [2]:
conn=sqlite3.connect('bookstore.db')

In [3]:
conn.execute("""CREATE TABLE IF NOT EXISTS Authors(
             author_id INTEGER PRIMARY KEY,
             name TEXT,
             country TEXT
             )""")

conn.execute("""CREATE TABLE IF NOT EXISTS Books(
             book_id INTEGER PRIMARY KEY,
             title TEXT,
             author_id INTEGER,
             price INTEGER,
             FOREIGN KEY (author_id) REFERENCES Authors(author_id)
             )""")

conn.execute("""CREATE TABLE IF NOT EXISTS Sales(
             sales_id INTEGER PRIMARY KEY,
             book_id TEXT,
             sale_date DATETIME,
             quantity INTEGER,
             FOREIGN KEY (book_id) REFERENCES Books(book_id)
             )""")

conn.commit()

In [5]:
cursor = conn.cursor()

list_authors=["INSERT INTO Authors (name, country) VALUES ('George Orwell', 'United Kingdom')",
"INSERT INTO Authors (name, country) VALUES ('Harper Lee', 'United States')",
"INSERT INTO Authors (name, country) VALUES ('J.K. Rowling', 'United Kingdom')",
"INSERT INTO Authors (name, country) VALUES ('J.R.R. Tolkien', 'United Kingdom')"]

for script in list_authors:
    cursor.execute(script)
    conn.commit()

In [7]:
list_books=["INSERT INTO Books (title, author_id, price) VALUES ('1984', 1, 9.99)",
"INSERT INTO Books (title, author_id, price) VALUES ('Animal Farm', 1, 7.99)",
"INSERT INTO Books (title, author_id, price) VALUES ('To Kill a Mockingbird', 2, 8.99)",
"INSERT INTO Books (title, author_id, price) VALUES ('Harry Potter and the Sorcerer''s Stone', 3, 10.99)",
"INSERT INTO Books (title, author_id, price) VALUES ('The Hobbit', 4, 12.99)"]

for script in list_books:
    cursor.execute(script)
    conn.commit()

In [8]:
list_sales=["INSERT INTO Sales (book_id, sale_date, quantity) VALUES (1, '2023-06-01', 50)",
"INSERT INTO Sales (book_id, sale_date, quantity) VALUES (2, '2023-06-01', 30)",
"INSERT INTO Sales (book_id, sale_date, quantity) VALUES (3, '2023-06-01', 40)",
"INSERT INTO Sales (book_id, sale_date, quantity) VALUES (4, '2023-06-01', 60)",
"INSERT INTO Sales (book_id, sale_date, quantity) VALUES (5, '2023-06-01', 25)",
"INSERT INTO Sales (book_id, sale_date, quantity) VALUES (1, '2023-06-02', 20)",
"INSERT INTO Sales (book_id, sale_date, quantity) VALUES (2, '2023-06-02', 25)",
"INSERT INTO Sales (book_id, sale_date, quantity) VALUES (3, '2023-06-02', 35)",
"INSERT INTO Sales (book_id, sale_date, quantity) VALUES (4, '2023-06-02', 50)",
"INSERT INTO Sales (book_id, sale_date, quantity) VALUES (5, '2023-06-02', 30)"]

for script in list_sales:
    cursor.execute(script)
    conn.commit()

In [7]:
# Retrieve a list of all books with their authors.
conn=sqlite3.connect('bookstore.db')
cursor=conn.cursor()

cursor.execute("""SELECT t1.title, t2.name FROM Books as t1 JOIN Authors as t2 ON t1.author_id=t2.author_id""")

books=cursor.fetchall()

new_list=[]

for i in books:
    new_list.append(i)

print(new_list)

[('1984', 'George Orwell'), ('Animal Farm', 'George Orwell'), ('To Kill a Mockingbird', 'Harper Lee'), ('1984', 'George Orwell'), ('Animal Farm', 'George Orwell'), ('To Kill a Mockingbird', 'Harper Lee'), ("Harry Potter and the Sorcerer's Stone", 'J.K. Rowling'), ('The Hobbit', 'J.R.R. Tolkien')]

In [12]:
# Calculate the total sales for each book.
cursor.execute("""SELECT t1.title, CONCAT('sum for all book sales ',FORMAT(t1.price*t2.quantity,2), ' €') FROM Books as t1 JOIN Sales as t2 ON t1.book_id=t2.book_id""")

sales=cursor.fetchall()

for i in sales:
   print(i)

('1984', 'sum for all book sales 499.5 €')
('Animal Farm', 'sum for all book sales 239.7 €')
('To Kill a Mockingbird', 'sum for all book sales 359.6 €')
('1984', 'sum for all book sales 599.4 €')
('Animal Farm', 'sum for all book sales 199.75 €')
('1984', 'sum for all book sales 199.8 €')
('Animal Farm', 'sum for all book sales 199.75 €')
('To Kill a Mockingbird', 'sum for all book sales 314.65 €')
('1984', 'sum for all book sales 499.5 €')
('Animal Farm', 'sum for all book sales 239.7 €')

In [23]:
# List the top 3 best-selling books.

cursor.execute("""SELECT t1.title, SUM(t2.b) as "Suma bendra" FROM Books as t1 JOIN Sales as t2 ON t1.book_id=t2.book_id GROUP BY t1.title ORDER BY "Suma bendra" DESC LIMIT 3""")

max_quantity=cursor.fetchall()

print(max_quantity)

[('1984', 180), ('Animal Farm', 110), ('To Kill a Mockingbird', 75)]

In [28]:
# Find the author with the highest number of books.

cursor.execute("""SELECT t1.name, COUNT(DISTINCT t2.title) as Quantity FROM Authors as t1 JOIN Books as t2 ON t1.author_id = t2.author_id
GROUP BY t1.name ORDER BY Quantity DESC LIMIT 1""")

max_quantity_author=cursor.fetchall()

print(max_quantity_author)

[('George Orwell', 2)]